# 1 Пользователь вводит с клавиатуры три числа в переменные a, b, c.
#Если все числа больше 10 и первые два числа делятся на 3, то вывести yes, иначе no

#a = int(input('Enter value a: '))
#b = int(input('Enter value b: '))
#c = int(input('Enter value c: '))

#if a > 10 and b > 10 and c > 10 and a % 3 == 0 and b % 3 == 0:

 #   print('yes')
#else:
 #   print('no')
#---------------------------------------------------------------------------------------------------------
# 2 Пользователь вводит с клавиатуры три числа в переменные a, b, c.
#Найдите наибольшее число из них и запишите в переменную max.

#a = int(input('Enter value a: '))
#b = int(input('Enter value b: '))
#c = int(input('Enter value c: '))

#if a > b > c:
#    print(f'Найбільше числоє {a}')
#elif b > a > c:
#        print(f'Найбільше числоє {b}')
#elif c > b > a:
# print(f'Найбільше числоє {c}')

# 3 - Пользователь вводит два числа A и B, нужно вывести сумму всех четных чисел в диапазоне от A до B.
#a = int(input('Enter value a: '))
#b = int(input('Enter value b: '))
#suma = 0
#if a > b:
#    x = a
#    a = b
#    b = x
    # a,b = b,a

#for n in range(a,b + 1):
#   if  n % 2 == 0:
#    suma = suma + n
#print(suma)











